// 生成字体的文件
// 编译字体
var Fontmin = require('fontmin');
var srcPath = './src/fonts/*.ttf'; // 字体源文件
var destPath = 'build/fonts';    // 输出路径
var text = `品牌Funtouch OS体验店政企业务社区购物车登录| 注册
iQOO专区
NEX系列
X系列
S系列
Z系列
Y系列
U系列
商城
服务
 
iQOO

新款

全部iQOO机型对比iQOO机型
NEX双屏版

新款

NEX旗舰版

NEX&NEX屏幕指纹版

全部NEX机型对比NEX机型
X27

新款

X27 Pro

新款

源自

X27 8GB+128GB版

新款

X23 幻彩版

X23

全部X机型对比X机型
S1

新款

S1 Pro

新款

全部S机型对比S机型
Z5x

新款

Z3x

新款

Z3

Z3i标准版

Z1青春版

全部Z机型对比Z机型
Y3

新款

Y91

Y93s

Y85

全部Y机型对比Y机型
U1

新款

呈

去除拍摄屏幕时产生的彩色不规则条纹，提升画面观感

全部U机型对比U机型
S9购买概览图库参数规格
官网购买 

门店购买 

*S9系列包括S9、S9e，图示产品为S9，图片仅供参考，请以实物为准．
*仅S9前置搭载双柔光灯及4400万像素主题，S9e前置搭载3200万像素主摄．
观看产品视频360°展示
纤薄基因，天生出色
好手感，好有幸福感
手感、质感、色感，拿捏得刚刚好。约7.35mm厚，约173g重，简洁直边中框+AG工艺后盖，幻彩光芒微闪，轻松握着躺玩不滑落。
缎面AG工艺打造，轻转时微透
光泽，如同晨曦透暖光
深海微晶AG工艺打造，手感更舒适，尽显夜色高级质感
全息光透AG工艺结合十色渐变，打造绚烂的朝夕景象
4400万双摄模组1
自拍，首先要惊艳自己
vivo S9前置再再再升级，自拍更有仪式感，自然更具美感。
超清AF自动对焦双摄+双极夜柔光灯，美有双全保障，让自拍悦己，合影悦众。
双摄模组

4400 万超清主摄+800 万超广角人像镜头
双极夜柔光灯

超清4400万前置1+ISOCELL 2.0技术
好的自拍，越清晰越自信
前置4400万1传感器应用了全新ISOCELL 2.0技术，感光能力提高12%2。更有更出色的色彩还原表现
与AF自动对焦，轻松拍出明晰动人的自然大片。
极夜柔光自拍
两位灯光师，够靓了吧
夜晚自拍，再添新装备！屏幕柔光环与柔光灯叠加14， 亮度轻松拉满，增加脸部柔和感与立体感，配合降噪和曝光修复算法，自拍清晰又自然。
3D霓虹光 - 蒸汽波
潮流艺术【全新光影风格】
光光光光是光影，就够秀了
自拍不该千篇一律。增加整体空间氛围感的3D霓虹光风格任你美出百色。更有搭配前置闪光灯推出的派对和闪光风格，让你玩转光影大片。
闪光灯人像 - 派对
前置105°超广角人像3
敞开镜头，留住更多朋友
有了105°超广角人像镜头3，无需再请路人帮拍聚会合照，自己掌镜就能拍进更多人，敞开镜头，环抱世界！
潮玩美拍
拍出自信，玩出个性
为你奉上有趣的自拍新玩法。前置3D五重超质感
美颜，各角度自拍都够美。双重曝光给你自由创
作权，爱豆、鲜花、云彩，尽情云合拍，轻易玩
出个性。
双重曝光2.0云合拍
超清合拍
6400万OIS超感光夜拍系统4
大千世界，大拍特拍
6400万超清主摄+OIS光学防抖，稳稳记录微美瞬间与壮丽景致。并有超感光夜拍系统，为你拍下烂漫星辰，梦幻霓虹，从早到晚不留遗憾。
6400 万超感光主摄

200 万微距镜头

800 万超广角镜头

黑光夜视
为你捕光，从不怕晚
在夜景模式中，ISO提升了3.24倍，曝光时间延长了2倍
在OIS的加持下，夜拍曝光时间延长2倍，进光量增加324%5，夜景成片自然细腻纯净，
让美在晚上也绽放出彩。创作欲，不因「太晚」而中止。
视频超级防抖+口袋电影大师
生活微电影，自拍自演
vlog兴致来了，手持就开拍，在颠簸与黑暗中录下清晰稳定的画面，搭配视频美颜与智能剪辑，
一键输出超级防抖精彩影像。
6nm旗舰芯片+双模5G6
这颗强芯脏，666
天玑1100芯片抢先体验：6nm制程、60W+跑分，泰尔实验室五级抗老化认证，36个月性能抗衰减，
看电影、玩游戏畅快无比。双模5G双卡双待6，无缝网络让体验精彩无穷。
畅快体验
竞技场上，你来带节奏
UFS 3.1 超快闪存加快存取，为你的畅玩之旅开道，配上90Hz高刷屏，手感视感顺到不行！
打开游戏魔盒10.0，畅享Multi-Turbo5.0，燃到不行！
12GB+256GB大运存7&内存融合+3G
超大运内存，做你的“流畅保镖”
256GB超大内存7，精彩想存就存。内存融合技术，可调用3GB储存空间到运存进行使用，
享受12+ 3GB的运存快感，同步打开27个应用照旧轻松cover！
德国莱茵TÜV低蓝光认证+
Hi-Res音质认证
好有眼福，更有耳福
德国莱茵TÜV低蓝光认证，可降低有害蓝光，呵护双眼，玩久点也不担心；好音质也经过Hi-Res认证，配上实时耳返，随时感受演唱会现场的嗨氛围。
德国莱茵TÜV低蓝光认证
Hi-Res音质认证+实时耳返
OriginOS
新世界，为你敞开
超高自由度的框架、创造力的原子组件、个性化的交互和设置体系、量身打造的影像和功能体验。
OriginOS，就是你可随心所欲改造的新世界。
相机 Mix
高光时刻，随时就位
行为壁纸
步步生花
智能追焦化妆镜
镜子随身，随时美丽
原子组件
小东西，可不止一点儿东西
去摩尔纹
提升画面观感，提供超清文档拍摄
注释
1. 前置 4400 万超高清主摄需切换至高像素模式（路径：相机-切换至前置-更多-高像素），方可输出 4400 万成像效果。
2. S9前置主摄感光能力较上代S7提升了12%。
3. 前置 105°广角镜头，105°为镜头参数，开启广角矫正后视角大小为 98.7°。
4. 后置6400万像素OIS超感光夜拍系统由 6400 万主摄、800 万超广角镜头、200 万微距镜头组成。
5. 对比S7，S9夜拍曝光时间延长2倍，进光量增加324%。
6. 本产品 5G 网络支持 SA & NSA 模式，SA 支持能力取决于可用的网络和软件版本；5G 网络具体组网情况及网络覆盖范围，以运营商实际部署为准。
7. 另有 8GB + 128GB 版本可供选购。由于手机系统和预装的程序占据了部分运存、储存空间，实际运存空间少于 8GB/12GB，可用储存空间少于 128GB/256GB。
7.在夜景模式中、对比S7，S9 ISO提升了3.24倍，曝光时间延长了2倍。
8. 页面内的手机外观示意图、内部结构图及产品效果仅供参考，实际可能因光线环境、生产批次的不同，存在颜色、丝印等细节差异，请以实物为准。
9. 以上页面的数据及参数为我司实验室标准环境下的测试结果，数据及参数的实际情况（例如：光圈参数）会因测试环境、测试软件、供应商材料批次等不同略有差异。
10. 以上样张效果仅供参考，不同拍摄模式的像素可能存在差异，部分样张大小经过裁剪，仅供参考，请以实际拍摄效果为准。
11. 由于产品的某些规格、参数、零部件、外观细节（例如：电池盖有无丝印）可能因供应商更换或生产批次等原因发生变化，vivo 将根据调整实时更新页面内的描述，请您仔细查看。
12. S9 使用第三方贴膜会影响屏幕指纹识别效果，请务必使用“vivo 屏幕指纹官方定制膜”。
13. 屏幕尺寸为按照标准矩形测量的屏幕直角对角线的长度，实际可视区域略小。
14. 前置人像、拍照模式支持屏幕柔光环与柔光灯叠加。
vivo WATCH
选购更多配件
iQOO系列
机型对比
iQOO 7

立即购买
iQOO 5

立即购买
碎屏宝
立即选购
官方正品	顺丰极速达	全国联保	镭射雕刻
线下购买
到vivo零售店亲身体验各种产品，我们还将为您解答各种问题。

查询网点
分期付款
花呗分期最低享0利率，0服务费。

分期购买
服务支持
为节省您的时间，您可以在自助服务中查找您所需的服务，我们将竭诚为您服务。

开始交流`;

// 初始化
var fontmin = new Fontmin()
    .src(srcPath)               
    .use(Fontmin.glyph({        // 字型提取插件
        text: text              // 所需文字
    }))
    .use(Fontmin.ttf2eot())     // eot 转换插件
    .use(Fontmin.ttf2woff())    // woff 转换插件     
    .use(Fontmin.ttf2svg())     // svg 转换插件
    .dest(destPath);            // 输出配置

// 执行
fontmin.run(function (err, files, stream) {
    if (err) {                  // 异常捕捉
        console.error('err1111111111111==>',err);
    }
    console.log('done');        // 成功
});